using StochasticModels

#-------------------------------------------------------------------------------------------#
#                                   1-D Merton Model                                        #
#-------------------------------------------------------------------------------------------#

# TODO: we should pass the jump parameters
u0     = 0.12
tspan  = (0.0, 1.0)
params = (μ=0.0, σ=1.0)

m = MertonModel(u0, params, tspan)

solve(m, SRIW1())

#-------------------------------------------------------------------------------------------#
#                                   N-D Merton Model                                        #
#-------------------------------------------------------------------------------------------#

# TODO: we should pass the jump parameters
u0     = [0.12, 0.23]
tspan  = (0.0, 1.0)
params = (μ=[0.0, 0.12], σ=Diagonal([1.0 0.0; 1.2 0.0]))

m = MertonModel(u0, params, tspan)

solve(m, SRA1())
